using System;

namespace найти_сло6ва_с_бук6вой_н
{
    class Program1
    {
        static void Main(string[] args)
        {
                  
            string s = @"Владей собой среди толпы смятенной,
Тебя клянущей за смятенье всех,
Верь сам в себя, наперекор вселенной,
И маловерным отпусти их грех;
Пусть час не пробил, жди, не уставая,
Пусть лгут лжецы, не снисходи до них;
Умей прощать и не кажись, прощая,
Великодушней и мудрей других.

Умей мечтать, не став рабом мечтанья,
И мыслить, мысли не обожествив;
Равно встречай успех и поруганье,
Не забывая, что их голос лжив;
Останься тих, когда твое же слово
Калечит плут, чтоб уловлять глупцов,
Когда вся жизнь разрушена, и снова
Ты должен все воссоздавать с основ.

Умей поставить, в радостной надежде,
На карту все, что накопил с трудом,
Все проиграть и нищим стать, как прежде,
И никогда не пожалеть о том;
Умей принудить сердце, нервы, тело
Тебе служить, когда в твоей груди
Уже давно все пусто, все сгорело.
И только Воля говорит: Иди!

Останься прост, беседуя с царями,
Останься честен, говоря с толпой;
Будь прям и тверд с врагами и с друзьями,
Пусть все, в свой час, считаются с тобой;
Наполни смыслом каждое мгновенье,
Часов и дней неумолимый бег,
Тогда весь мир ты примешь, как владенье,
Тогда, мой сын, ты будешь Человек!";
                s = s.Replace('.', ' ');
                s = s.Replace(',', ' ');
                s = s.Replace(';', ' ');
                s = s.Replace(':', ' ');
                s = s.Replace('!', ' ');
                s = s.Replace('"', ' ');
            string[] arr = s.Split(' ');
            string slovo;
            string bukva;
            string st;
            string[] arr1 = new String [arr.Length]; 
            for (int i = 0; i < arr.Length; i++)
            {
                slovo = arr[i];
                for (int j = 0; j < slovo.Length; j++)
                {

                    bukva = slovo.Substring(j, 1);
                    if (bukva.Equals("н"))
                    {
                        arr1[i] =slovo;                          
                        break;                            
                    }
                }
            }
            st = String.Join(" ",arr1);
            Console.WriteLine(st);
        }
    }
}
